9/data/attachments/c3d45b4ecc3c1615.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_08dddee8-a5fa-454e-b38a-8c429f776567</nif:username>
            <nif:friendToBeAdded>Richard_customer_Actions_12283_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>